#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
//int main()
//{
//	unsigned char a = 100;
//	//00000000000000000000000001100100-100
//	//01100100-a
//	//进行运输的时候会进行整形提升，因为是unsigned，所以前面提升补0，如果是有符号的，就按照补码符号位进行整形提升
//	//00000000000000000000000001100100-整形提升后的a
//	unsigned char b = 200;
//	//00000000000000000000000011001000-200
//	//11001000-b
//	//00000000000000000000000011001000-整形提升后的b
//	//00000000000000000000000001100100-整形提升后的a
//	//00000000000000000000000100101100-a+b的值-打印出来为300
//	//c只能存储一个字节，所以c-00101100  符号位为0，所以原码反码补码一样打印出来是44
//	unsigned char c;
//	c = a + b;
//	printf("%d %d", a + b, c);
//}

//打印杨辉三角形
//1
//11
//121
//1331
//#define ROW 10
//int main()
//{
//	int arr[ROW][10] = {0};
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < 10; j++)
//		{
//			arr[i][0] = 1;
//			if (i == j)
//			{
//				arr[i][j] = 1;//先把最外面的一圈1赋值
//			}
//			if ((i >= 2)&&(j>=1))
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//
//		}
//	}
//
//	for (i = 0; i < 10; i++)
//	{
//		//打印空格
//		for (j = 0; j < ROW-i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j <=i; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//猜凶手
//int main()
//{
//	int killer = 'a';
//	for (killer = 'a'; killer <= 'd'; killer++)
//	{
//		if ((killer != 'a') + (killer == 'c') + (killer == 'd') + (killer != 'd') == 3)
//		{
//			printf("凶手是%c ", killer);
//		}
//	}
//	return 0;
//}


//猜名次
int main()
{
	int a, b, c, d, e;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (((b==2)+(a==3)==1)&&((b==2)+(e==4)==1)&&((c==1)+(d==2)==1)&&((c==5)+(d==3)==1)&&((e==4)+(a==1)==1))
						{
							if (a*b*c*d*e == 120)
							{
								printf("a=%d b=%d c=%d d=%d e=%d", a, b, c, d, e);
							}
						}
					}
				}
			}
		}
	}
	return 0;
}